brew 'stow'

brew 'bash'
brew 'zsh'

brew 'jq'
brew 'tree'
brew 'wget'
brew 'ctags'
brew 'cmake'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'htop'
brew 'coreutils'
brew 'findutils'
brew 'grep'

tap 'neovim/neovim'
brew 'neovim'

brew 'git'

brew 'go'
brew 'markdown'

cask_args appdir: '/Applications'
tap 'homebrew/cask'

cask 'iterm2'

brew 'awscli'
cask 'aws-vault'

# broken
# cask 'google-cloud-sdk'

brew 'tfenv'

# no bottle for arm
# brew 'vault'

brew 'kubernetes-cli'
brew 'kubernetes-helm'

cask 'docker'

cask 'slack'
cask 'spotify'
cask 'caffeine'
cask '1password'
cask '1password-cli'

tap 'homebrew/cask-fonts'
cask 'font-hack'
