brew 'stow'

brew 'bash'
brew 'zsh'

brew 'jq'
brew 'tree'
brew 'wget'
brew 'ctags'
brew 'cmake'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'htop'
brew 'coreutils'
brew 'findutils'
brew 'grep'

tap 'neovim/neovim'
brew 'neovim'

brew 'git'
brew 'hub'
brew 'gist'

brew 'go'
brew 'markdown'
brew 'shellcheck'

cask_args appdir: '/Applications'
tap 'caskroom/cask'

cask 'iterm2'

brew 'awscli'
cask 'aws-vault'
cask 'google-cloud-sdk'

brew 'tfenv'
brew 'vault'

brew 'kubernetes-cli'
brew 'kubernetes-helm'

cask 'docker'

cask 'slack'
cask 'spotify'
cask 'caffeine'
cask 'dropbox'
cask '1password'
cask '1password-cli'
cask 'google-chrome'

tap 'caskroom/drivers'
cask 'sonos'

cask 'font-hack'

tap 'homebrew/cask-versions'

cask 'little-snitch'
cask 'micro-snitch'
